{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[UNK]": 3,
      "[CLS]": 4,
      "[SEP]": 5,
      "[MASK]": 6,
      "0": 7,
      "1": 8,
      "2": 9,
      "3": 10,
      "4": 11,
      "5": 12,
      "6": 13,
      "7": 14,
      "8": 15,
      "9": 16,
      "a": 17,
      "b": 18,
      "c": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "j": 26,
      "k": 27,
      "l": 28,
      "m": 29,
      "n": 30,
      "o": 31,
      "p": 32,
      "q": 33,
      "r": 34,
      "s": 35,
      "t": 36,
      "u": 37,
      "v": 38,
      "w": 39,
      "x": 40,
      "y": 41,
      "z": 42,
      "A": 43,
      "B": 44,
      "C": 45,
      "D": 46,
      "E": 47,
      "F": 48,
      "G": 49,
      "H": 50,
      "I": 51,
      "J": 52,
      "K": 53,
      "L": 54,
      "M": 55,
      "N": 56,
      "O": 57,
      "P": 58,
      "Q": 59,
      "R": 60,
      "S": 61,
      "T": 62,
      "U": 63,
      "V": 64,
      "W": 65,
      "X": 66,
      "Y": 67,
      "Z": 68,
      "+": 69,
      "-": 70,
      "=": 71,
      "<": 72,
      ">": 73,
      "!": 74,
      "|": 75,
      "'": 76,
      ".": 77,
      ",": 78,
      ";": 79,
      ":": 80,
      "/": 81,
      "&": 82,
      "(": 83,
      ")": 84,
      "[": 85,
      "]": 86,
      "{": 87,
      "}": 88,
      "^": 89,
      "_": 90,
      "\\leq": 91,
      "\\geq": 92,
      "\\neq": 93,
      "\\approx": 94,
      "\\equiv": 95,
      "\\sim": 96,
      "\\simeq": 97,
      "\\times": 98,
      "\\div": 99,
      "\\cdot": 100,
      "\\pm": 101,
      "\\mp": 102,
      "\\oplus": 103,
      "\\ominus": 104,
      "\\otimes": 105,
      "\\oslash": 106,
      "\\odot": 107,
      "\\bullet": 108,
      "\\star": 109,
      "\\ast": 110,
      "\\ddagger": 111,
      "\\propto": 112,
      "\\cong": 113,
      "\\ll": 114,
      "\\gg": 115,
      "\\prec": 116,
      "\\succ": 117,
      "\\preceq": 118,
      "\\succeq": 119,
      "\\ne": 120,
      "\\le": 121,
      "\\ge": 122,
      "\\alpha": 123,
      "\\beta": 124,
      "\\gamma": 125,
      "\\delta": 126,
      "\\epsilon": 127,
      "\\varepsilon": 128,
      "\\zeta": 129,
      "\\eta": 130,
      "\\theta": 131,
      "\\vartheta": 132,
      "\\iota": 133,
      "\\kappa": 134,
      "\\lambda": 135,
      "\\mu": 136,
      "\\nu": 137,
      "\\xi": 138,
      "\\pi": 139,
      "\\varpi": 140,
      "\\rho": 141,
      "\\varrho": 142,
      "\\sigma": 143,
      "\\varsigma": 144,
      "\\tau": 145,
      "\\upsilon": 146,
      "\\phi": 147,
      "\\varphi": 148,
      "\\chi": 149,
      "\\psi": 150,
      "\\omega": 151,
      "\\imath": 152,
      "\\jmath": 153,
      "\\Gamma": 154,
      "\\Delta": 155,
      "\\Theta": 156,
      "\\Lambda": 157,
      "\\Xi": 158,
      "\\Pi": 159,
      "\\Sigma": 160,
      "\\Upsilon": 161,
      "\\Phi": 162,
      "\\Psi": 163,
      "\\Omega": 164,
      "\\nabla": 165,
      "\\sin": 166,
      "\\cos": 167,
      "\\tan": 168,
      "\\cot": 169,
      "\\sec": 170,
      "\\csc": 171,
      "\\log": 172,
      "\\ln": 173,
      "\\exp": 174,
      "\\det": 175,
      "\\lim": 176,
      "\\max": 177,
      "\\min": 178,
      "\\gcd": 179,
      "\\arg": 180,
      "\\sinh": 181,
      "\\cosh": 182,
      "\\tanh": 183,
      "\\arcsin": 184,
      "\\arccos": 185,
      "\\arctan": 186,
      "\\sup": 187,
      "\\inf": 188,
      "\\ker": 189,
      "\\deg": 190,
      "\\dim": 191,
      "\\hom": 192,
      "\\Pr": 193,
      "\\mod": 194,
      "\\frac": 195,
      "\\sqrt": 196,
      "\\binom": 197,
      "\\sum": 198,
      "\\int": 199,
      "\\prod": 200,
      "\\oint": 201,
      "\\iint": 202,
      "\\iiint": 203,
      "\\overline": 204,
      "\\underline": 205,
      "\\hat": 206,
      "\\tilde": 207,
      "\\vec": 208,
      "\\bar": 209,
      "\\dot": 210,
      "\\ddot": 211,
      "\\widehat": 212,
      "\\widetilde": 213,
      "\\overbrace": 214,
      "\\underbrace": 215,
      "\\overset": 216,
      "\\underset": 217,
      "\\stackrel": 218,
      "\\limits": 219,
      "\\nolimits": 220,
      "\\displaystyle": 221,
      "\\textstyle": 222,
      "\\scriptstyle": 223,
      "\\in": 224,
      "\\notin": 225,
      "\\ni": 226,
      "\\subset": 227,
      "\\subseteq": 228,
      "\\supset": 229,
      "\\supseteq": 230,
      "\\cup": 231,
      "\\cap": 232,
      "\\emptyset": 233,
      "\\varnothing": 234,
      "\\forall": 235,
      "\\exists": 236,
      "\\nexists": 237,
      "\\neg": 238,
      "\\land": 239,
      "\\lor": 240,
      "\\vee": 241,
      "\\wedge": 242,
      "\\to": 243,
      "\\rightarrow": 244,
      "\\leftarrow": 245,
      "\\Rightarrow": 246,
      "\\Leftarrow": 247,
      "\\Leftrightarrow": 248,
      "\\mapsto": 249,
      "\\longrightarrow": 250,
      "\\longleftarrow": 251,
      "\\uparrow": 252,
      "\\downarrow": 253,
      "\\Uparrow": 254,
      "\\Downarrow": 255,
      "\\setminus": 256,
      "\\vdash": 257,
      "\\models": 258,
      "\\top": 259,
      "\\bot": 260,
      "\\infty": 261,
      "\\partial": 262,
      "\\perp": 263,
      "\\angle": 264,
      "\\ldots": 265,
      "\\cdots": 266,
      "\\vdots": 267,
      "\\ddots": 268,
      "\\prime": 269,
      "\\ell": 270,
      "\\hbar": 271,
      "\\aleph": 272,
      "\\wp": 273,
      "\\Re": 274,
      "\\Im": 275,
      "\\triangle": 276,
      "\\square": 277,
      "\\diamond": 278,
      "\\parallel": 279,
      "\\asymp": 280,
      "\\sqsubseteq": 281,
      "\\sqsupseteq": 282,
      "\\not": 283,
      "\\backslash": 284,
      "\\left": 285,
      "\\right": 286,
      "\\lfloor": 287,
      "\\rfloor": 288,
      "\\lceil": 289,
      "\\rceil": 290,
      "\\langle": 291,
      "\\rangle": 292,
      "\\vert": 293,
      "\\Vert": 294,
      "\\big": 295,
      "\\Big": 296,
      "\\bigg": 297,
      "\\Bigg": 298,
      "\\bigl": 299,
      "\\bigr": 300,
      "\\Bigl": 301,
      "\\Bigr": 302,
      "\\biggl": 303,
      "\\biggr": 304,
      "\\Biggl": 305,
      "\\Biggr": 306,
      "\\mathbb": 307,
      "\\mathcal": 308,
      "\\mathfrak": 309,
      "\\mathbf": 310,
      "\\mathrm": 311,
      "\\mathit": 312,
      "\\mathsf": 313,
      "\\mathtt": 314,
      "\\text": 315,
      "\\textbf": 316,
      "\\textit": 317,
      "\\textrm": 318,
      "\\boldsymbol": 319,
      "\\begin": 320,
      "\\end": 321,
      "matrix": 322,
      "pmatrix": 323,
      "bmatrix": 324,
      "vmatrix": 325,
      "cases": 326,
      "array": 327,
      "align": 328,
      "equation": 329,
      "gather": 330,
      "aligned": 331,
      "\\\\": 332,
      "\\,": 333,
      "\\;": 334,
      "\\:": 335,
      "\\!": 336,
      "\\quad": 337,
      "\\qquad": 338,
      "~": 339,
      "\\clubsuit": 340,
      "\\diamondsuit": 341,
      "\\heartsuit": 342,
      "\\spadesuit": 343,
      "\\flat": 344,
      "\\natural": 345,
      "\\sharp": 346,
      "\\dagger": 347,
      "\\nearrow": 348,
      "\\searrow": 349,
      "\\swarrow": 350,
      "\\nwarrow": 351,
      "\\sqcup": 352,
      "\\sqcap": 353,
      "\\sqsubset": 354,
      "\\sqsupset": 355,
      "\\uplus": 356,
      "\\wr": 357,
      "\\amalg": 358,
      "\\triangleleft": 359,
      "\\triangleright": 360,
      "\\lbrace": 361,
      "\\rbrace": 362,
      "\\lvert": 363,
      "\\rvert": 364,
      "\\lVert": 365,
      "\\rVert": 366,
      "\\mathbb{R}": 367,
      "\\mathbb{Z}": 368,
      "\\mathbb{N}": 369,
      "\\mathbb{Q}": 370,
      "\\mathbb{C}": 371,
      "dx": 372,
      "dy": 373,
      "dt": 374,
      "%": 375,
      "#": 376,
      "$": 377,
      "@": 378,
      "`": 379,
      "\\nleq": 380,
      "\\ngeq": 381,
      "\\nsubseteq": 382,
      "\\nsupseteq": 383,
      "\\ncong": 384,
      "\\nsim": 385,
      "\\lim_{": 386,
      "\\sum_{": 387,
      "\\int_{": 388,
      "\\prod_{": 389,
      "\\mathrm{d}": 390,
      "\\operatorname": 391,
      "\\rightleftharpoons": 392,
      "\\leftrightarrow": 393,
      "\\hookrightarrow": 394,
      "\\hookleftarrow": 395,
      "\\circ": 396,
      "\\pmod": 397,
      "\\colorbox": 398,
      "\\color": 399,
      "\\underbrace_{": 400,
      "\\overbrace^{": 401,
      "\\hat{x}": 402,
      "\\bar{x}": 403,
      "\\vec{x}": 404,
      "\\dot{x}": 405,
      "\\ddot{x}": 406,
      "\\tilde{x}": 407,
      "\\bm": 408,
      "\\pmb": 409,
      "\\eqref": 410,
      "\\ref": 411,
      "\\label": 412,
      "\\newline": 413,
      "\\hline": 414,
      "\\cline": 415,
      "\\Vdash": 416,
      "\\vDash": 417,
      "\\nvdash": 418,
      "\\nvDash": 419,
      "\\therefore": 420,
      "\\because": 421,
      "\\lozenge": 422,
      "\\blacksquare": 423,
      "\\blacktriangle": 424,
      "\\blacktriangledown": 425,
      "\\blacklozenge": 426,
      "\\sphericalangle": 427,
      "\\measuredangle": 428,
      "\\cancel": 429,
      "\\bcancel": 430,
      "\\xcancel": 431,
      "\\underdot": 432,
      "\\dotdot": 433,
      "\\eqno": 434,
      "\\tag": 435,
      "\\max_{": 436,
      "\\min_{": 437,
      "\\lim_{n \\to \\infty}": 438,
      "\\xleftarrow": 439,
      "\\xrightarrow": 440,
      "\\underbracket": 441,
      "\\overbracket": 442,
      "\\mathring": 443,
      "\\check": 444,
      "\\breve": 445,
      "\\acute": 446,
      "\\grave": 447
    },
    "unk_token": "[UNK]"
  }
}